grevaillot/svd_tools/headers/STM32F7x7/dma2.h
#define DMA2_S3FCR_FS_SHIFT		3
#define DMA2_S3FCR_FS_MASK		0x07
/** @defgroup dma2_s3fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA2_S3FCR_DMDIS Direct mode disable **/
#define DMA2_S3FCR_DMDIS		(1 << 2)

#define DMA2_S3FCR_FTH_SHIFT		0
#define DMA2_S3FCR_FTH_MASK		0x03
/** @defgroup dma2_s3fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s4cr S4CR stream x configuration register
@{*/


#define DMA2_S4CR_CHSEL_SHIFT		25
#define DMA2_S4CR_CHSEL_MASK		0x07
/** @defgroup dma2_s4cr_chsel CHSEL Channel selection
@{*/
/**@}*/


#define DMA2_S4CR_MBURST_SHIFT		23
#define DMA2_S4CR_MBURST_MASK		0x03
/** @defgroup dma2_s4cr_mburst MBURST Memory burst transfer configuration
@{*/
/**@}*/


#define DMA2_S4CR_PBURST_SHIFT		21
#define DMA2_S4CR_PBURST_MASK		0x03
/** @defgroup dma2_s4cr_pburst PBURST Peripheral burst transfer configuration
@{*/
/**@}*/

/** DMA2_S4CR_ACK ACK **/
#define DMA2_S4CR_ACK		(1 << 20)
/** DMA2_S4CR_CT Current target (only in double buffer mode) **/
#define DMA2_S4CR_CT		(1 << 19)
/** DMA2_S4CR_DBM Double buffer mode **/
#define DMA2_S4CR_DBM		(1 << 18)

#define DMA2_S4CR_PL_SHIFT		16
#define DMA2_S4CR_PL_MASK		0x03
/** @defgroup dma2_s4cr_pl PL Priority level
@{*/
/**@}*/

/** DMA2_S4CR_PINCOS Peripheral increment offset size **/
#define DMA2_S4CR_PINCOS		(1 << 15)

#define DMA2_S4CR_MSIZE_SHIFT		13
#define DMA2_S4CR_MSIZE_MASK		0x03
/** @defgroup dma2_s4cr_msize MSIZE Memory data size
@{*/
/**@}*/


#define DMA2_S4CR_PSIZE_SHIFT		11
#define DMA2_S4CR_PSIZE_MASK		0x03
/** @defgroup dma2_s4cr_psize PSIZE Peripheral data size
@{*/
/**@}*/

/** DMA2_S4CR_MINC Memory increment mode **/
#define DMA2_S4CR_MINC		(1 << 10)
/** DMA2_S4CR_PINC Peripheral increment mode **/
#define DMA2_S4CR_PINC		(1 << 9)
/** DMA2_S4CR_CIRC Circular mode **/
#define DMA2_S4CR_CIRC		(1 << 8)

#define DMA2_S4CR_DIR_SHIFT		6
#define DMA2_S4CR_DIR_MASK		0x03
/** @defgroup dma2_s4cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA2_S4CR_PFCTRL Peripheral flow controller **/
#define DMA2_S4CR_PFCTRL		(1 << 5)
/** DMA2_S4CR_TCIE Transfer complete interrupt enable **/
#define DMA2_S4CR_TCIE		(1 << 4)
/** DMA2_S4CR_HTIE Half transfer interrupt enable **/
#define DMA2_S4CR_HTIE		(1 << 3)
/** DMA2_S4CR_TEIE Transfer error interrupt enable **/
#define DMA2_S4CR_TEIE		(1 << 2)
/** DMA2_S4CR_DMEIE Direct mode error interrupt enable **/
#define DMA2_S4CR_DMEIE		(1 << 1)
/** DMA2_S4CR_EN Stream enable / flag stream ready when read low **/
#define DMA2_S4CR_EN		(1 << 0)

/**@}*/

/** @defgroup dma2_s4ndtr S4NDTR stream x number of data register
@{*/


#define DMA2_S4NDTR_NDT_SHIFT		0
#define DMA2_S4NDTR_NDT_MASK		0xffff
/** @defgroup dma2_s4ndtr_ndt NDT Number of data items to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s4par S4PAR stream x peripheral address register
@{*/


#define DMA2_S4PAR_PA_SHIFT		0
#define DMA2_S4PAR_PA_MASK		0xffffffff
/** @defgroup dma2_s4par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s4m0ar S4M0AR stream x memory 0 address register
@{*/


#define DMA2_S4M0AR_M0A_SHIFT		0
#define DMA2_S4M0AR_M0A_MASK		0xffffffff
/** @defgroup dma2_s4m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s4m1ar S4M1AR stream x memory 1 address register
@{*/


#define DMA2_S4M1AR_M1A_SHIFT		0
#define DMA2_S4M1AR_M1A_MASK		0xffffffff
/** @defgroup dma2_s4m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s4fcr S4FCR stream x FIFO control register
@{*/

/** DMA2_S4FCR_FEIE FIFO error interrupt enable **/
#define DMA2_S4FCR_FEIE		(1 << 7)

#define DMA2_S4FCR_FS_SHIFT		3
#define DMA2_S4FCR_FS_MASK		0x07
/** @defgroup dma2_s4fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA2_S4FCR_DMDIS Direct mode disable **/
#define DMA2_S4FCR_DMDIS		(1 << 2)

#define DMA2_S4FCR_FTH_SHIFT		0
#define DMA2_S4FCR_FTH_MASK		0x03
/** @defgroup dma2_s4fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2_s5cr S5CR stream x configuration register
@{*/


#define DMA2_S5CR_CHSEL_SHIFT		25
#define DMA2_S5CR_CHSEL_MASK		0x0f
/** @defgroup dma2_s5cr_chsel CHSEL Channel selection
@{*/
/**@}*/


#define DMA2_S5CR_MBURST_SHIFT		23
#define DMA2_S5CR_MBURST_MASK		0x03
/** @defgroup dma2_s5cr_mburst MBURST Memory burst transfer configuration
@{*/
/**@}*/


#define DMA2_S5CR_PBURST_SHIFT		21
#define DMA2_S5CR_PBURST_MASK		0x03
/** @defgroup dma2_s5cr_pburst PBURST Peripheral burst transfer configuration
@{*/
/**@}*/

/** DMA2_S5CR_ACK ACK **/
#define DMA2_S5CR_ACK		(1 << 20)
/** DMA2_S5CR_CT Current target (only in double buffer mode) **/
#define DMA2_S5CR_CT		(1 << 19)
/** DMA2_S5CR_DBM Double buffer mode **/
#define DMA2_S5CR_DBM		(1 << 18)

#define DMA2_S5CR_PL_SHIFT		16
#define DMA2_S5CR_PL_MASK		0x03
/** @defgroup dma2_s5cr_pl PL Priority level
@{*/
/**@}*/

/** DMA2_S5CR_PINCOS Peripheral increment offset size **/
#define DMA2_S5CR_PINCOS		(1 << 15)

#define DMA2_S5CR_MSIZE_SHIFT		13
#define DMA2_S5CR_MSIZE_MASK		0x03
/** @defgroup dma2_s5cr_msize MSIZE Memory data size
@{*/
/**@}*/


#define DMA2_S5CR_PSIZE_SHIFT		11
#define DMA2_S5CR_PSIZE_MASK		0x03
/** @defgroup dma2_s5cr_psize PSIZE Peripheral data size
@{*/
/**@}*/

/** DMA2_S5CR_MINC Memory increment mode **/
#define DMA2_S5CR_MINC		(1 << 10)
/** DMA2_S5CR_PINC Peripheral increment mode **/
#define DMA2_S5CR_PINC		(1 << 9)
/** DMA2_S5CR_CIRC Circular mode **/
#define DMA2_S5CR_CIRC		(1 << 8)

#define DMA2_S5CR_DIR_SHIFT		6
#define DMA2_S5CR_DIR_MASK		0x03
/** @defgroup dma2_s5cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA2_S5CR_PFCTRL Peripheral flow controller **/
#define DMA2_S5CR_PFCTRL		(1 << 5)
/** DMA2_S5CR_TCIE Transfer complete interrupt enable **/
#define DMA2_S5CR_TCIE		(1 << 4)
/** DMA2_S5CR_HTIE Half transfer interrupt enable **/
#define DMA2_S5CR_HTIE		(1 << 3)
/** DMA2_S5CR_TEIE Transfer error interrupt enable **/
#define DMA2_S5CR_TEIE		(1 << 2)
/** DMA2_S5CR_DMEIE Direct mode error interrupt enable **/
#define DMA2_S5CR_DMEIE		(1 << 1)
/** DMA2_S5CR_EN Stream enable / flag stream ready when read low **/
#define DMA2_S5CR_EN		(1 << 0)

/**@}*/

